# DoubLines

## Description
<b>DoubLines is obsolete as of VectorWorks12.5</b>
Procedure DoubLines sets the line spacing width for double-line tools.

```pascal
PROCEDURE DoubLines(doubleLineDistance : REAL);
```

```python
def vs.DoubLines(doubleLineDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|doubleLineDistance|REAL|Width between lines.|

## Examples
eateWallObject2}}

## Version
DoubLines is obsolete as of VectorWorks12.5<P>

Availability: from All Versions

## Category
* Document Settings